In [1]:
from datascience import *
import numpy as np

# NumPy Array examples

These are some of the things we can do in NumPy!

In [2]:
temperatures = make_array(3, 11, 7, 5, 6, 10, 12, 14, 15.6, 3.4, 2.1)
temperatures

array([ 3. , 11. ,  7. ,  5. ,  6. , 10. , 12. , 14. , 15.6,  3.4,  2.1])

In [3]:
np.multiply?

In [7]:
temperatures * (9.0/5.0) + 32

array([37.4 , 51.8 , 44.6 , 41.  , 42.8 , 50.  , 53.6 , 57.2 , 60.08,
       38.12, 35.78])

# Some more NumPy Examples with Tables

Let's do the same thing with tables!

In [9]:
cities = Table().read_table("cities.csv")
cities

Name                         | City         | State      | Temperature in C
Colebank, Jordan Elise       | San Franciso | California | 13
Collins, Matthew T           | Atlanta      | Georgia    | 9
Cook, Kylie Nichole          | Seattle      | Washington | 6
Downard, Andrew Nicholas     | nan          | nan        | 0
Duerinck, Randy Keith        | New York     | New York   | -10
Graham, Cassandra Michelle   | Cincinnati   | Ohio       | -12
Hodge, Devin Jonathan Monroe | Kansas City  | Missouri   | -4
Hoover, David R              | Sahuarita    | Arizona    | 19
Linden, Andrew Ryan          | Portland     | Oregon     | 6
Lynn, Matthew Michael        | Dallas       | Texas      | 10
... (3 rows omitted)

In [13]:
cities.column("Temperature in C") * 9.0/5.0 + 32.0

array([55.4  , 48.2  , 42.8  , 32.   , 14.   , 10.4  , 24.8  , 66.2  ,
       42.8  , 50.   , 32.   , 57.218, 60.8  ])

In [14]:
cities.with_column("Temperature in F", cities.column("Temperature in C") * 9.0/5.0 + 32.0)

Name                         | City         | State      | Temperature in C | Temperature in F
Colebank, Jordan Elise       | San Franciso | California | 13               | 55.4
Collins, Matthew T           | Atlanta      | Georgia    | 9                | 48.2
Cook, Kylie Nichole          | Seattle      | Washington | 6                | 42.8
Downard, Andrew Nicholas     | nan          | nan        | 0                | 32
Duerinck, Randy Keith        | New York     | New York   | -10              | 14
Graham, Cassandra Michelle   | Cincinnati   | Ohio       | -12              | 10.4
Hodge, Devin Jonathan Monroe | Kansas City  | Missouri   | -4               | 24.8
Hoover, David R              | Sahuarita    | Arizona    | 19               | 66.2
Linden, Andrew Ryan          | Portland     | Oregon     | 6                | 42.8
Lynn, Matthew Michael        | Dallas       | Texas      | 10               | 50
... (3 rows omitted)